<a href="https://colab.research.google.com/github/Olimjon77/2_oy_imtihon/blob/main/43_dars_vazifa.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
%load_ext sql
%sql sqlite://

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [ ]:
import pandas as pd

In [ ]:
# Read datasets from CSV files
films = pd.read_csv('/content/films.csv', header=None)
films = films.rename(columns={1: 'title',
                              2: 'release_year',
                              3: 'country',
                              4: 'duration',
                              5: 'language',
                              6: 'certification',
                              7:'gross',
                              8:'budget'})
reviews = pd.read_csv('/content/reviews.csv', header=None)
reviews = reviews.rename(columns={1: 'film_id',
                                  2: 'num_user',
                                  3: 'num_critic',
                                  4: 'imdb_score',
                                  5: 'num_votes',
                                  6: 'facebook_likes'})
people = pd.read_csv('/content/people.csv', header=None)
people = people.rename(columns={1: 'name',
                                2: 'birthdate',
                                3: 'deaddate'})
roles = pd.read_csv('/content/roles.csv', header=None)
roles = roles.rename(columns={1: 'film_id',
                              2: 'person_id',
                              3: 'role'})

# Drop tables if they exist, then persist the DataFrames to the SQL database
%sql DROP TABLE IF EXISTS films;
%sql --persist films

%sql DROP TABLE IF EXISTS reviews;
%sql --persist reviews

%sql DROP TABLE IF EXISTS people;
%sql --persist people

%sql DROP TABLE IF EXISTS roles;
%sql --persist roles

 * sqlite://
Done.
 * sqlite://
 * sqlite://
Done.
 * sqlite://
 * sqlite://
Done.
 * sqlite://
 * sqlite://
Done.
 * sqlite://

'Persisted roles'

In [ ]:
%%sql
SELECT *
FROM films
LIMIT 10;

 * sqlite://
Done.

[(0, 1, "Intolerance: Love's Struggle Throughout the Ages", 1916.0, 'USA', 123.0, None, 'Not Rated', None, 385907.0),
 (1, 2, 'Over the Hill to the Poorhouse', 1920.0, 'USA', 110.0, None, None, 3000000.0, 100000.0),
 (2, 3, 'The Big Parade', 1925.0, 'USA', 151.0, None, 'Not Rated', None, 245000.0),
 (3, 4, 'Metropolis', 1927.0, 'Germany', 145.0, 'German', 'Not Rated', 26435.0, 6000000.0),
 (4, 5, "Pandora's Box", 1929.0, 'Germany', 110.0, 'German', 'Not Rated', 9950.0, None),
 (5, 6, 'The Broadway Melody', 1929.0, 'USA', 100.0, 'English', 'Passed', 2808000.0, 379000.0),
 (6, 7, "Hell's Angels", 1930.0, 'USA', 96.0, 'English', 'Passed', None, 3950000.0),
 (7, 8, 'A Farewell to Arms', 1932.0, 'USA', 79.0, 'English', 'Unrated', None, 800000.0),
 (8, 9, '42nd Street', 1933.0, 'USA', 89.0, 'English', 'Unrated', 2300000.0, 439000.0),
 (9, 10, 'She Done Him Wrong', 1933.0, 'USA', 66.0, 'English', 'Approved', None, 200000.0)]

In [ ]:
%%sql
SELECT DISTINCT language
FROM films
WHERE country = 'USA'
      AND release_year BETWEEN 1960 AND 2010;

 * sqlite://
Done.

[('English',),
 (None,),
 ('Spanish',),
 ('Aramaic',),
 ('Filipino',),
 ('Cantonese',),
 ('Maya',),
 ('Vietnamese',),
 ('Japanese',),
 ('Hindi',),
 ('Dari',)]

In [ ]:
%%sql
SELECT *
FROM films
WHERE duration BETWEEN 60 AND 120
   AND release_year >= 2010
   AND (country = 'USA' OR country =  "UK")
   AND language <> 'English';

 * sqlite://
Done.

[(3914, 3915, 'Casa de mi Padre', 2012.0, 'USA', 84.0, 'Spanish', 'R', 5895238.0, 6000000.0),
 (4037, 4038, 'The Act of Killing', 2012.0, 'UK', 96.0, 'Indonesian', 'Not Rated', 484221.0, 1000000.0),
 (4299, 4300, 'The Knife of Don Juan', 2013.0, 'USA', 110.0, 'Spanish', None, 3830.0, 1200000.0),
 (4354, 4355, 'Addicted', 2014.0, 'USA', 106.0, 'Spanish', 'R', 17382982.0, 5000000.0),
 (4576, 4577, 'Trash', 2014.0, 'UK', 114.0, 'Portuguese', 'R', 10230.0, None),
 (4799, 4800, 'They Will Have to Kill Us First', 2015.0, 'UK', 105.0, 'French', None, None, 400000.0),
 (4860, 4861, 'Indignation', 2016.0, 'USA', 110.0, 'Hebrew', 'R', 560512.0, None)]

In [ ]:
%%sql
SELECT AVG(duration) AS avg_duration,
       MIN(duration) AS shortest_film,
       MAX(duration) AS longest_film,
       COUNT(*) AS total_films
FROM films;

 * sqlite://
Done.

[(107.94793138244198, 7.0, 334.0, 4968)]

In [ ]:
%%sql
SELECT ROUND(AVG(duration), 2) AS avg_duration,
       MIN(duration) AS shortest_film,
       MAX(duration) AS longest_film,
       COUNT(*) AS total_films
FROM films
WHERE country = "UK"
       AND release_year BETWEEN 1999 AND  2010
       AND title LIKE 'O%';

 * sqlite://
Done.

[(111.33, 97.0, 130.0, 3)]

In [ ]:
%%sql
SELECT ROUND(AVG(duration), 2) AS avg_duration,
       MIN(duration) AS shortest_film,
       MAX(duration) AS longest_film,
       COUNT(*) AS total_films
FROM films
WHERE language = "English"
       AND release_year BETWEEN 1999 AND  2010
       AND title LIKE 'O%';

 * sqlite://
Done.

[(100.03, 76.0, 139.0, 38)]

In [ ]:
%%sql
SELECT AVG(gross) AS avg_gross,
       MIN(gross) AS lowest_gross,
       MAX(gross) AS highest_gross,
       COUNT(*) AS total_films
FROM films
WHERE country = "India"
       AND release_year BETWEEN 1999 AND  2010
       AND title LIKE 'a%';

 * sqlite://
Done.

[(16892.0, 16892.0, 16892.0, 1)]

In [ ]:
%%sql
SELECT AVG(gross - budget) AS avg_gross,
       MIN(gross - budget) AS lowest_gross,
       MAX(gross - budget) AS highest_gross,
       COUNT(*) AS total_films
FROM films
WHERE country = "India"
       AND budget IS NOT NULL
       AND release_year BETWEEN 1960 AND  2020;

 * sqlite://
Done.

[(-109711828.92857143, -696724557.0, 6876974.0, 19)]

In [ ]:
%%sql
SELECT AVG(gross - budget) AS avg_gross,
       MIN(gross - budget) AS lowest_gross,
       MAX(gross - budget) AS highest_gross,
       COUNT(*) AS total_films
FROM films
WHERE country = "India"
       AND release_year BETWEEN 1960 AND  2020
       AND title LIKE 'a%';

 * sqlite://
Done.

[(-283108.0, -283108.0, -283108.0, 3)]

In [ ]:
%%sql
SELECT  DISTINCT title, certification, gross, budget, language
FROM films
WHERE 2.5 * budget <= gross and
  country = 'Germany' AND
  release_year >= 2000;

 * sqlite://
Done.

[('Rugrats in Paris: The Movie', 'G', 76501438.0, 30000000.0, 'English'),
 ('Jeepers Creepers', 'R', 37470017.0, 10000000.0, 'English'),
 ('Bowling for Columbine', 'R', 21244913.0, 4000000.0, 'English'),
 ('Van Wilder: Party Liaison', 'R', 21005329.0, 6000000.0, 'English'),
 ('Crash', 'R', 54557348.0, 6500000.0, 'English'),
 ('Nacho Libre', 'PG', 80197993.0, 32000000.0, 'English'),
 ('The Lives of Others', 'R', 11284657.0, 2000000.0, 'German')]

In [ ]:
%%sql
SELECT *
FROM people
LIMIT 10;

 * sqlite://
Done.

[(0, 1, '50 Cent', '1975-07-06', None),
 (1, 2, 'A. Michael Baldwin', '1963-04-04', None),
 (2, 3, 'A. Raven Cruz', None, None),
 (3, 4, 'A.J. Buckley', '1978-02-09', None),
 (4, 5, 'A.J. DeLucia', None, None),
 (5, 6, 'A.J. Langer', '1974-05-22', None),
 (6, 7, 'Aaliyah', '1979-01-16', '2001-08-25'),
 (7, 8, 'Aaron Ashmore', '1979-10-07', None),
 (8, 9, 'Aaron Hann', None, None),
 (9, 10, 'Aaron Hill', '1983-04-23', None)]

In [ ]:
%%sql
SELECT COUNT(*)
FROM people;

 * sqlite://
Done.

[(8397,)]

In [ ]:
%%sql
SELECT COUNT(*)
FROM people
WHERE birthdate IS NULL;

 * sqlite://
Done.

[(2245,)]

In [ ]:
%%sql
SELECT COUNT(*)
FROM people
WHERE birthdate IS NULL
      AND deaddate IS NULL;

 * sqlite://
Done.

[(2239,)]

In [ ]:
%%sql
SELECT COUNT(*)
FROM people
WHERE birthdate IS NOT NULL
      AND deaddate IS NOT NULL;

 * sqlite://
Done.

[(781,)]

In [ ]:
%%sql
SELECT COUNT(*)
FROM people
WHERE name LIKE '%A%';

 * sqlite://
Done.

[(6655,)]

In [ ]:
%%sql
SELECT COUNT(*)
FROM people
WHERE name NOT LIKE '_A%';

 * sqlite://
Done.

[(6220,)]

In [ ]:
%%sql
SELECT COUNT(*)
FROM people
WHERE name NOT LIKE '%A';

 * sqlite://
Done.

[(7957,)]

In [ ]:
%%sql
SELECT name
FROM people
WHERE name LIKE '%ALI';

 * sqlite://
Done.

[('Christophe Ali',), ('Tatyana Ali',), ('Vincenzo Natali',)]

In [ ]:
%%sql
SELECT MAX(name)
FROM people
WHERE name LIKE 'A%';

 * sqlite://
Done.

[('Azura Skye',)]

In [ ]:
%%sql
SELECT name, birthdate, deaddate
FROM people
WHERE birthdate = (SELECT MIN(birthdate)
              FROM people);

 * sqlite://
Done.

[('Robert Shaw', '1837-10-10', '1863-07-18')]

In [ ]:
%%sql
SELECT name, birthdate, deaddate
FROM people
WHERE deaddate-birthdate = (SELECT MAX(deaddate - birthdate)
              FROM people);

 * sqlite://
Done.

[('Ellen Albertini Dow', '1913-11-16', '2015-05-04'),
 ('Zohra Segal', '1912-04-27', '2014-07-10')]

In [ ]:
%%sql
SELECT name, birthdate, deaddate
FROM people
WHERE deaddate-birthdate = (SELECT MIN(deaddate - birthdate)
              FROM people);

 * sqlite://
Done.

[('Judith Barsi', '1978-06-06', '1988-07-25')]

In [ ]:
%%sql
SELECT *
FROM roles
LIMIT 10;

 * sqlite://
Done.

[(0, 1, 1, 1630, 'director'),
 (1, 2, 1, 4843, 'actor'),
 (2, 3, 1, 5050, 'actor'),
 (3, 4, 1, 8175, 'actor'),
 (4, 5, 2, 3000, 'director'),
 (5, 6, 2, 4019, 'actor'),
 (6, 7, 2, 5274, 'actor'),
 (7, 8, 2, 7449, 'actor'),
 (8, 9, 3, 1459, 'actor'),
 (9, 10, 3, 3929, 'actor')]

In [ ]:
%%sql
SELECT COUNT(*)
FROM roles;

 * sqlite://
Done.

[(19791,)]

In [ ]:
%%sql
SELECT COUNT(*)
FROM roles
WHERE role = 'actor';

 * sqlite://
Done.

[(14862,)]

In [ ]:
%%sql
SELECT *
FROM films
WHERE "0" = (SELECT film_id
                 FROM reviews
                 WHERE imdb_score = (SELECT MAX(imdb_score)
                                     FROM reviews));

 * sqlite://
Done.

[(4143, 4144, 'Bending Steel', 2013.0, 'USA', 92.0, 'English', None, None, 50000.0)]

In [ ]:
%%sql
SELECT *
FROM films
WHERE "0" = (SELECT film_id
                 FROM reviews
                 WHERE num_votes = (SELECT MAX(num_votes)
                                     FROM reviews));

 * sqlite://
Done.

[(4079, 4080, 'The Twilight Saga: Breaking Dawn - Part 2', 2012.0, 'USA', 115.0, 'English', 'PG-13', 292298923.0, 120000000.0)]

In [ ]:
%%sql
SELECT *
FROM people
WHERE "0" = (SELECT film_id
                 FROM reviews
                 WHERE imdb_score = (SELECT MAX(imdb_score)
                                     FROM reviews));

 * sqlite://
Done.

[(4143, 4144, 'Joseph Mazzella', '1983-09-21', None)]

In [ ]:
%%sql
SELECT *
FROM people
WHERE "0" = (SELECT film_id
                 FROM reviews
                 WHERE num_votes = (SELECT MAX(num_votes)
                                     FROM reviews));

 * sqlite://
Done.

[(4079, 4080, 'Jonathan Jakubowicz', '1978-01-29', None)]

In [ ]:
%%sql
SELECT 0, title, release_year,	country	duration,	language,	certification,	gross,	budget, gross - budget AS profit
FROM films
WHERE   gross - budget = (SELECT MAX(gross - budget)
                          FROM films);

 * sqlite://
Done.

[(0, 'Star Wars: Episode VII - The Force Awakens', 2015.0, 'USA', 'English', 'PG-13', 936627416.0, 245000000.0, 691627416.0)]

In [ ]:
%%sql
SELECT *
FROM people
WHERE "0" = (SELECT "0"
                 FROM films
                 WHERE   gross - budget = (SELECT MAX(gross - budget)
                                     FROM films));

 * sqlite://
Done.

[(4745, 4746, 'Lee Daniels', '1959-12-24', None)]